Repository: celariss/flutter_heating_control_app
Catalog: lib/l10n/app_*.arb
Languages: fr

source: No
fr: Non

source: Yes
fr: Oui

source: New
fr: Nouveau

source: Unknown
fr: Inconnu

# editAction
source: Edit{item, select, eqptlist{ devices list} other{}}
fr: Editer{item, select, eqptlist{ la liste des vannes} other{}}

# addAction
source: Add{item, select, slots{ daily timeslots} subschedule{ sub-schedule} other{}}
fr: Ajouter{item, select, slots{ une plage hebdomadaire} subschedule{ un sous-planning} other{}}

# cloneAction
source: Clone
fr: Dupliquer

# removeAction
source: Remove
fr: Supprimer

# closeAction
source: Close
fr: Fermer

# cancelAction
source: Cancel
fr: Annuler

# validateAction
source: Validate
fr: Valider

# continueAction
source: Continue
fr: Continuer

# popupPickDeviceTitle
source: Devices selection
fr: Sélection des équipements

# popupPickPlanningTitle
source: Pick a planning
fr: Sélection d'un planning

# popupPickColorTitle
source: Pick a color
fr: Sélection de la couleur

# popupErrorTitle
source: Error
fr: Erreur

# popupWarningTitle
source: Warning
fr: Attention

# popupWaitingConnection
source: Waiting for server connection ...
fr: Connexion en cours ...

# removeConfirmation
source: Do you confirm the removing of {item, select, eqpt{equipement} schedule{schedule} tempset{temperature set} subschedule{this sub-schedule} timeslots{this daily timeslots} other{}} '{name}' ?
fr: Etes-vous sûr de vouloir supprimer {item, select, eqpt{l'équipement} schedule{le planning} tempset{le jeu} subschedule{ce sous-planning} timeslots{cette plage hebdomadaire} other{}} '{name}' ?

# errorDuplicateKey
source: The key '{key}' already exists ...
fr: Le nom '{key}' existe déjà ...

# weekChipMonday
source: Mo
fr: Lu

# weekChipTuesday
source: Tu
fr: Ma

# weekChipWednesday
source: We
fr: Me

# weekChipThurday
source: Th
fr: Je

# weekChipFriday
source: Fr
fr: Ve

# weekChipSunday
source: Su
fr: Di

# navbarHome
source: Home
fr: Accueil

# navbarTempsets
source: TÂ° Sets
fr: Jeux de T°

# navbarPlannings
source: Schedules
fr: Plannings

# snackbarBackButton
source: Press twice to exit
fr: Appuyez une 2ième fois pour sortir

# msgInfoCode_mqttServerConnected
source: Connected to server
fr: Connecté au serveur

# msgInfoCode_mqttServerDisconnected
source: Disconnected from server !
fr: Déconnecté du serveur !

# msgInfoCode_mqttMessageError
source: Malformed message received from server !
fr: Message défectueux reçu du serveur !

# msgInfoCode_controlServerAvailable
source: Heating control server available
fr: Serveur de contrôle du chauffage disponible

# msgInfoCode_controlServerUnavailable
source: Heating control server unavailable !
fr: Serveur de contrôle du chauffage injoignable !

# srvResponseDialogTitle
source: Change has been refused
fr: Changement refusé

# srvResponseRefused
source: Change has been refused !
fr: Changement refusé !

# srvResponseDuplicateKey
source: Key '{key}' is already declared !
fr: L'identifiant '{key}' est déjà utilisé !

# srvResponseEmptyList
source: The list can't be empty !
fr: La liste ne peut pas être vide !

# srvResponseBadValue
source: Value '{value}' is not allowed !
fr: La valeur '{value}' n'est pas autorisée !

# srvResponseCircularRef
source: Circular reference detected between following temp sets : {aliases}
fr: Une dépendance circulaire a été détectée entre les jeux de température suivants : {aliases}

# srvResponseMissingValue
source: Value '{value}' is missing in list !
fr: La valeur '{value}' est manquante dans la liste !

# settingsPageTitle
source: Settings
fr: Paramètres

# settingsAppVersion
source: Application version : v{version}
fr: Version application : v{version}

# settingsErrorMandatoryValue
source: value is mandatory
fr: Une valeur est obligatoire

# settingsGroupMain
source: Main
fr: Général

# settingsLanguage
source: Language
fr: Langue

# settingsSystemLanguage
source: System
fr: Système

# settingsEditDevicesList
source: Edit devices list
fr: Editer la liste des vannes

# settingsTheme
source: Theme
fr: Thème

# settingsThermostatRes
source: thermostats resolution
fr: Résolution thermostats

# settingsGroupManualReset
source: Manual valve setpoint handling
fr: Gestion Consigne Manuelle (Vanne)

# settingsManualResetMode
source: Auto mode back mode
fr: Mode de retour en mode auto

# settingsManualResetDuration
source: Time until return
fr: Durée avant retour

# settingsManualResetMode_Duration
source: Duration (hours)
fr: Durée (heures)

# settingsManualResetMode_TimeslotChange
source: Timeslot change
fr: Changement plage

# settingsManualResetMode_SetPointChange
source: Setpoint change
fr: Changement consigne

# settingsGroupMqtt
source: MQTT connexion settings
fr: Paramètres de connexion MQTT

# settingsBrokerAddress
source: Broker adresss
fr: Adresse broker

# settingsUsername
source: Username
fr: Utilisateur

# settingsPassword
source: Password
fr: Mot de passe

# devicesEditorTitle
source: List of thermostats
fr: Liste des thermostats

# devicesEditorEditTitle
source: Device properties
fr: Propriétés de l'équipement

# devicesEditorEditEntity
source: Entity
fr: Entité

# devicesEditorEditName
source: Name
fr: Nom

# homePageTitle
source: Home
fr: Accueil

# homePageNoActiveSchedule
source: No active schedule
fr: Aucun planning actif

# homePageActiveSchedule
source: Current active schedule
fr: Planning actif

# tempSetsPageTitle
source: Temperature Sets
fr: Jeux de T°

# tempSetEditTitle
source: Temperature set properties
fr: Propriétés du Jeu

# tempSetEditName
source: Name
fr: Nom

# tempSetEditNameHint
source: Set name
fr: Nom du jeu

# tempSetEditColor
source: Color
fr: Couleur

# timeslotWeekA
source: wA
fr: sA

# timeslotWeekB
source: wB
fr: sB

# timeslotAddAfter
source: Add after
fr: Ajouter dessous

# timeslotSetEditTitle
source: Edition of a daily schedule
fr: Edition d'une Plage hebdomadaire

# schedulesPageTitle
source: Schedules
fr: Plannings

# schedulesPageErrorMissingThermostatAndTempSet
source: Please first add a thermostat and create a temperature set ...
fr: Il faut commencer par ajouter un thermostat et créer un jeu de températures ...

# scheduleEditTitle
source: Planning properties
fr: Propriétés du planning

# scheduleEditName
source: Name
fr: Nom

# scheduleEditNameHint
source: Planning name
fr: Nom du planning

# timeslotsFortnightSwitch
source: Fortnight mode on/off
fr: Quinzaine on/off

# timeslotsErrorNotEmpty
source: Some weekdays are still active on this daily timeslots
fr: Certains jours de la semaine sont encore affectés à cette plage hebdomadaire
